# Brewfile — Homebrew packages that mise can't manage (GUI apps, fonts and
# system/daemon tools). Runtimes and most CLI tools live in mise.toml instead.
#
#   brew bundle --file=Brewfile

# --- Formulae: system/daemon tools kept on Homebrew ---
brew "zsh-syntax-highlighting" # sourced from the brew prefix in .zshrc
brew "autojump"                # shell integration via brew's profile.d hook
brew "watch"
brew "telnet"
brew "htop"
brew "wget"
brew "tig"
brew "docker"                  # CLI; talks to the docker-machine VM
brew "docker-machine"
brew "podman"

# --- Casks: GUI applications ---
cask "vagrant"
cask "virtualbox"
cask "podman-desktop"
cask "maccy"
cask "google-chrome"
cask "intellij-idea"
cask "alfred"
cask "iterm2"
cask "spotify"
cask "slack"
cask "ngrok"
cask "visual-studio-code"

# --- Fonts (includes Powerline glyphs) ---
cask "font-hack-nerd-font"
